# Exercise - Getting and Knowing your Data-Occupation Dataset

This time we are going to pull data directly from the internet.


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [5]:
users = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep = '|')
users.set_index('user_id', inplace = True)

### Step 4. See the first 25 entries

In [6]:
users.sample(25)

         age gender     occupation zip_code
user_id
258       19      F        student    77801
421       38      F     programmer    55105
829       48      M         writer    80209
207       39      M      marketing    92037
702       37      M          other    89104
562       54      F  administrator    20879
467       29      M       engineer    91201
233       38      M       engineer    98682
941       20      M        student    97229
468       28      M       engineer    02341
179       15      M  entertainment    20755
157       57      M       engineer    70808
355       25      M        student    60135
796       32      F         writer    33755
883       49      M      librarian    50266
221       19      M        student    20685
225       51      F  administrator    58202
648       43      M       engineer    91351
197       55      M     technician    75094
753       56      M       salesman    91206
733       44      F          other    60630
477       23      F        student    02125
596       20      M         artist    77073
270       18      F        student    63119
378       35      M        student    02859

### Step 5. See the last 10 entries

In [8]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [10]:
print('Number of observations: ',users.shape[0])

Number of observations:  943

### Step 7. What is the number of columns in the dataset?

In [12]:
print('Number of columns: ', len(users.columns))

Number of columns:  4

### Step 8. Print the name of all the columns.

In [17]:
print("The name of the columns are: ")
for i in users.columns:
    print(i)

The name of the columns are:
age
gender
occupation
zip_code

### Step 9. How is the dataset indexed?

### Ans: It is indexed using the user_id column

### Step 10. What is the data type of each column?

In [23]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [24]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [47]:
print("The various occupations in the dataset are: ")
for i in users['occupation'].unique():
    print(i)
print("The total number of unique occupations: ",len(users['occupation'].unique()))

The various occupations in the dataset are:
technician
other
writer
executive
administrator
student
lawyer
educator
scientist
entertainment
programmer
librarian
homemaker
artist
engineer
marketing
none
healthcare
retired
salesman
doctor
The total number of unique occupations:  21

### Step 13. What is the most frequent occupation?

In [37]:
print("The most frequent occupation is: ")
for i in users['occupation'].value_counts()[:1].index.tolist():
    print(i)

The most frequent occupation is:
student

### Step 14. Summarize the DataFrame.

In [43]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [48]:
users.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [51]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [53]:
print('The mean age of the users is: ',users['age'].mean())

The mean age of the users is:  34.05196182396607

### Step 18. What is the age with least occurrence?

In [56]:
print("The minimum age of the users is: ", users['age'].min())

The minimum age of the users is:  7

In [68]:
dict = users['age'].value_counts(ascending=True)
d_items = dict.items()
print('The ages with the least occurrences are: ')
for key,value in d_items:
    if value == 1:
        print(key)

The ages with the least occurrences are:
7
66
73
10
11